{
  "audio_vae": {
    "model": {
      "params": {
        "ddconfig": {
          "attn_resolutions": [],
          "causality_axis": "height",
          "ch": 128,
          "ch_mult": [
            1,
            2,
            4
          ],
          "double_z": true,
          "downsample_time": false,
          "dropout": 0.0,
          "in_channels": 2,
          "mel_bins": 64,
          "mid_block_add_attention": false,
          "norm_type": "pixel",
          "num_res_blocks": 2,
          "out_ch": 2,
          "resolution": 256,
          "z_channels": 8
        },
        "embed_dim": 8,
        "sampling_rate": 16000
      }
    },
    "preprocessing": {
      "audio": {
        "causal_padding": 3,
        "duration": 5.12,
        "max_wav_value": 32768.0,
        "sampling_rate": 16000,
        "stereo": true
      },
      "mel": {
        "mel_fmax": 8000,
        "mel_fmin": 0,
        "n_mel_channels": 64
      },
      "stft": {
        "causal": true,
        "filter_length": 1024,
        "hop_length": 160,
        "win_length": 1024
      }
    }
  },
  "scheduler": {
    "_class_name": "RectifiedFlowScheduler",
    "_diffusers_version": "0.25.1",
    "base_resolution": null,
    "num_train_timesteps": 1000,
    "sampler": "LinearQuadratic",
    "shifting": null
  },
  "transformer": {
    "_class_name": "AVTransformer3DModel",
    "_diffusers_version": "0.25.1",
    "activation_fn": "gelu-approximate",
    "attention_bias": true,
    "attention_head_dim": 128,
    "attention_type": "default",
    "audio_attention_head_dim": 64,
    "audio_cross_attention_dim": 2048,
    "audio_num_attention_heads": 32,
    "audio_out_channels": 128,
    "audio_positional_embedding_max_pos": [
      20
    ],
    "av_ca_timestep_scale_multiplier": 1000.0,
    "av_cross_ada_norm": true,
    "caption_channels": 3840,
    "causal_temporal_positioning": true,
    "connector_attention_head_dim": 128,
    "connector_norm_output": true,
    "connector_num_attention_heads": 30,
    "connector_num_layers": 2,
    "connector_num_learnable_registers": 128,
    "connector_positional_embedding_max_pos": [
      4096
    ],
    "cross_attention_dim": 4096,
    "cross_attention_norm": true,
    "double_self_attention": false,
    "dropout": 0.0,
    "frequencies_precision": "float64",
    "in_channels": 128,
    "norm_elementwise_affine": false,
    "norm_eps": 1e-06,
    "norm_num_groups": 32,
    "num_attention_heads": 32,
    "num_embeds_ada_norm": 1000,
    "num_layers": 48,
    "num_vector_embeds": null,
    "only_cross_attention": false,
    "out_channels": 128,
    "positional_embedding_max_pos": [
      20,
      2048,
      2048
    ],
    "positional_embedding_theta": 10000.0,
    "positional_embedding_type": "rope",
    "qk_norm": "rms_norm",
    "rope_type": "split",
    "share_ff": false,
    "standardization_norm": "rms_norm",
    "timestep_scale_multiplier": 1000,
    "upcast_attention": false,
    "use_audio_video_cross_attention": true,
    "use_embeddings_connector": true,
    "use_linear_projection": false,
    "use_middle_indices_grid": true
  },
  "vae": {
    "_class_name": "CausalVideoAutoencoder",
    "causal_decoder": false,
    "decoder_base_channels": 128,
    "decoder_blocks": [
      [
        "res_x",
        {
          "inject_noise": false,
          "num_layers": 5
        }
      ],
      [
        "compress_all",
        {
          "multiplier": 2,
          "residual": true
        }
      ],
      [
        "res_x",
        {
          "inject_noise": false,
          "num_layers": 5
        }
      ],
      [
        "compress_all",
        {
          "multiplier": 2,
          "residual": true
        }
      ],
      [
        "res_x",
        {
          "inject_noise": false,
          "num_layers": 5
        }
      ],
      [
        "compress_all",
        {
          "multiplier": 2,
          "residual": true
        }
      ],
      [
        "res_x",
        {
          "inject_noise": false,
          "num_layers": 5
        }
      ]
    ],
    "dims": 3,
    "encoder_base_channels": 128,
    "encoder_blocks": [
      [
        "res_x",
        {
          "num_layers": 4
        }
      ],
      [
        "compress_space_res",
        {
          "multiplier": 2
        }
      ],
      [
        "res_x",
        {
          "num_layers": 6
        }
      ],
      [
        "compress_time_res",
        {
          "multiplier": 2
        }
      ],
      [
        "res_x",
        {
          "num_layers": 6
        }
      ],
      [
        "compress_all_res",
        {
          "multiplier": 2
        }
      ],
      [
        "res_x",
        {
          "num_layers": 2
        }
      ],
      [
        "compress_all_res",
        {
          "multiplier": 2
        }
      ],
      [
        "res_x",
        {
          "num_layers": 2
        }
      ]
    ],
    "in_channels": 3,
    "latent_channels": 128,
    "latent_log_var": "uniform",
    "norm_layer": "pixel_norm",
    "normalize_latent_channels": false,
    "out_channels": 3,
    "patch_size": 4,
    "scaling_factor": 1.0,
    "timestep_conditioning": false,
    "use_quant_conv": false
  },
  "vocoder": {
    "resblock": "1",
    "resblock_dilation_sizes": [
      [
        1,
        3,
        5
      ],
      [
        1,
        3,
        5
      ],
      [
        1,
        3,
        5
      ]
    ],
    "resblock_kernel_sizes": [
      3,
      7,
      11
    ],
    "stereo": true,
    "upsample_initial_channel": 1024,
    "upsample_kernel_sizes": [
      16,
      15,
      8,
      4,
      4
    ],
    "upsample_rates": [
      6,
      5,
      2,
      2,
      2
    ]
  }
}